package com.tutorial2.where_here.Info_Strings;

import android.provider.ContactsContract;

import com.tutorial2.where_here.R;

import java.util.ArrayList;

public class Info_Strings {


    public String[] info_title = {"드라켄","크라크","발키리","드래곤레이스","파에톤",//5
    "메가드롭","트리키리키의 볼하우스","드롤의 위자드 트레인","글린다의 매직펌킨","부기의 문라이트 세일",//10
    "스와니의 클라우드 라이드","페기의 케로셀","스파키의 매직카","토네이도","그랜드캐년대탐험",//15
    "범퍼카","급류타기","패밀리 바이킹","고스트하우스","타가디스코",//20
    "가족열차","서라벌관람차","비룡열차","미로탐험","섬머린스플래쉬",//25
    "킹 바이킹","에어벌룬","바운스스핀","댄싱컵"};//29

    public String[] info_intro = {
            "앞으로 뒤로 전장을 날아다니는 발키리 격렬한 전투의 흔적 속에서 용맹히 싸우다 전사한 용사들의 영혼을 수거하는 발키리와 함께 흙의 보물을 찾아 떠나보세요!",//1
            "세계 6번째, 국내 최초! 90도 다이브코스터! 63m 높이에서 수직 하강! 2drop까지! 지금껏 느껴볼 수 없던 최강 스릴에 도전하세요!\n (드라켄밸리 내 ‘마지막 보물 반지’가 숨겨진 곳)",//2
            "360도 회전하는 메가톤급 스릴 라이드! 거칠게 좌우로 몰아치다가 거꾸로 매달리는 아찔한 스릴을 느껴보세요!\n(드라켄밸리 내 ‘불의 보물’이 숨겨진 곳)",//3
            "아기 드래곤이 나는 연습을 하는 곳! 귀여운 아기드래곤이 날아가며 갈수록 빨라지는 360도 회전을 기대하세요!\n(드라켄밸리 내 ‘바람의 보물’이 숨겨진 곳)",//4
            "그리스 파에톤 신화를 테마로 한 세계 최강의 인버티드 롤러코스터! 초고속 익스트림 스릴을 직접 느껴보세요!",//5

            "지상 70m 하늘에서 떨어지는 기분! 하늘에서 내려다보는 경치와 급하강 할 때 심장 쫄깃한 스릴을 느껴보세요!",//6
            "알록달록 다양한 색깔 스펀지 공으로 재미있는 공놀이! 과학의 원리가 들어 있는 신기한 게임 속으로 모두 빠져보세요.",//7
            "드롤이 초대하는 환상의 마법마을 기차! 장난꾸러기 드롤과 함께 즐겁고 신나는 기차여행, 함께 떠나요! (어린이기차)",//8
            "예쁜 돼지 공주 글린다가 마법의 주문을 걸어놓은 매직 펌킨을 타고 파티장으로 떠나요! 안전손잡이도 꼭 잡으세요! (호박 마차)",//9
            "거북이 마법사 부기선장과 달빛여행! 하늘을 나는 마법의 배를 타고 부기와 함께 밤하늘 여행을 떠나 보세요.",//10

            "위자드가든에서 하늘을 꼭 한번 보세요. 위자드 가든의 높은 곳에 고니마법사와 스와니가 구름 사이로 날아다녀요! (하늘 자전거)",//11
            "페기의 케로셀이 마법으로 여러분을 공주와 왕자로 변신시킬 거에요! 빙글빙글 달리는 말과 마차도 타보세요! (회전목마)",//12
            "장난 꾸러기 스파키는 작지만 요리조리 재빠르고 멋진 운전사랍니다 함께 신나는 자동차 여행을 떠나요! (어린이 자동차)",//13
            "국내 최고의 스릴 어트랙션 토네이도! 국내 최대 상승각도 왕복 230도에서 느끼는 가슴 터질 듯한 스릴! 직접 느껴보세요!",//14
            "아메리카 대륙의 그랜드캐년 협곡 속에 아찔한 급류를 탐험하러 떠나요! 엄청난 물살이 휘몰아치며 신나게 빠져듭니다",//15

            "이리 쿵! 저리 쿵! 추억의 범퍼카! 요리조리 좌충우돌 박치기도 하고 신나고 멋진 드라이버가 되어 보세요!",//16
            "가파른 수로를 따라 아찔한 급류타기! 통나무배를 타고 떠나는 모험과 스릴! 물보라의 시원함과 계곡 물살을 느껴보세요!",//17
            "바이킹과 보물섬을 향해 출발! 해적선이 거대한 파도를 타듯 빠르게 급상승, 급하강하며 짜릿한 스릴을 느껴보세요!",//18
            "짜릿한 공포 속으로 두근두근 오싹! 괴기스러운 공포 속으로 빠져들어 보세요! 등뒤에서 갑자기 귀신과 유령이 나타납니다",//19
            "신나는 디스코 음악에 소리 질러! 재미있는 타가다 DJ의 재치와 함께 빙글빙글 회전무대에서 색다른 재미를 느껴보세요!",//20

            "가족, 연인, 친구들이 함께 증기 기관차를 타면서 여행을 떠나요. 여행 중 무시무시한 공룡들도 만나보세요!",//21
            "연인들의 데이트 필수 코스! 캐빈을 타고 지상 50m까지 올라가면 놀이공원과 보문관광단지가 한 눈에 펼쳐집니다!",//22
            "드래곤을 타고 꼬불꼬불 오르락 내리락! 아이들이 더 좋아하는 비룡열차! 하늘을 날아갈 듯 달리는 비룡열차를 타보세요!",//23
            "미로를 따라 구르고 넘어지는 재미! 이상한 에피소드와 미션에 도전하세요 무슨 일이 일어날지 아무도 몰라요!",//24
            "국내 최초, 아시아 최고 높이 32m 수상 롤러코스터! 초대형 물폭풍을 일으키며 고공낙하하는 아찔한 스피드와 스릴을 한 방에 느껴보세요!\n(여름시즌에는 캘리포니아비치에서 이용 가능합니다)",//25

            "중세 시대 바이킹을 재현해낸 웅장한 스케일! 바이킹 사상 역대급 스릴을 자랑하는 국내 최고 규모의 킹바이킹입니다",//26
            "빙글빙글 하늘을 날아가는 신나는 여행! 알록달록 에어벌룬이 두둥실 날아오르면 하늘 높이 여행을 떠날 수 있어요!",//27
            "요리조리 통통 튀는 바운스! 언제 어떻게 튈지 모르는 즐거움! 스핀까지 있어 더 짜릿한 스릴을 느껴요!",//28
            "알록달록 예쁜 댄싱 컵이 빙글빙글! 댄싱컵 속에서 손잡이를 돌리면 컵이 빙글빙글 돌아가며 춤추는 기분이 들어요!"};//29

    public int[] info_images ={R.drawable.rides_1,R.drawable.rides_2,R.drawable.rides_3,R.drawable.rides_4,R.drawable.rides_5,
            R.drawable.rides_6,R.drawable.rides_7,R.drawable.rides_8,R.drawable.rides_9,R.drawable.rides_10,
            R.drawable.rides_11,R.drawable.rides_12,R.drawable.rides_13,R.drawable.rides_14,R.drawable.rides_15,
            R.drawable.rides_16,R.drawable.rides_17,R.drawable.rides_18,R.drawable.rides_19,R.drawable.rides_20,
            R.drawable.rides_21,R.drawable.rides_22,R.drawable.rides_23,R.drawable.rides_24,R.drawable.rides_25,
            R.drawable.rides_26,R.drawable.rides_27,R.drawable.rides_28,R.drawable.rides_29};

}

